zsh.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-09-02 Mon 13:22 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Linux - ZSH</title>
<meta name="generator" content="Org mode">
<meta name="author" content="shaka">
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Linux - ZSH</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc8ff641">Introduction</a></li>
<li><a href="#org6ac0028">Installation</a></li>
<li><a href="#orgcfe5b20">Configuration</a>
<ul>
<li><a href="#org36b06ee">Mandatory</a></li>
<li><a href="#orgb35a4d7">Optional</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc8ff641" class="outline-2">
<h2 id="orgc8ff641">Introduction</h2>
<div class="outline-text-2" id="text-orgc8ff641">
<p>
As is well-known, <i>shell</i> is an interface provided by the Unix/Linux operation systems (OS) to subscribers whereby a user can interact with the kernel of the OS efficiently and conveniently.
</p>

<p>
In fact, there are already a variety of shells, e.g., bash, csh, tcsh, zsh, etc. This post just presented a brief introduction to <i>zsh</i>.
</p>

<p>
Zsh is indeed a powerful shell. Perhaps this is just the reason why it is termed "shell terminator", as letter 'Z' is the letter terminator, the last one in the alphabeta.
</p>
</div>
</div>
<div id="outline-container-org6ac0028" class="outline-2">
<h2 id="org6ac0028">Installation</h2>
<div class="outline-text-2" id="text-org6ac0028">
<p>
For Archlinux, zsh can be easily installed by the following command.
</p>
<div class="org-src-container">
<pre class="src src-sh">pacman -S zsh
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcfe5b20" class="outline-2">
<h2 id="orgcfe5b20">Configuration</h2>
<div class="outline-text-2" id="text-orgcfe5b20">
</div>
<div id="outline-container-org36b06ee" class="outline-3">
<h3 id="org36b06ee">Mandatory</h3>
<div class="outline-text-3" id="text-org36b06ee">
<p>
After the installation, zsh can be made as the default shell by
</p>
<div class="org-src-container">
<pre class="src src-sh">chsh -s /bin/zsh
</pre>
</div>
<p>
Before that, all the shells available can be listed by
</p>
<div class="org-src-container">
<pre class="src src-sh">chsh -l
</pre>
</div>
<p>
Then, you can add your own configuration in <code>~/.zshrc</code>.
</p>
</div>
</div>
<div id="outline-container-orgb35a4d7" class="outline-3">
<h3 id="orgb35a4d7">Optional</h3>
<div class="outline-text-3" id="text-orgb35a4d7">
<p>
Even though zsh is usable out of the box, future configuration is necessary since the customization can really improve our experiences.
</p>

<p>
Regarding the customization, there exists a toolkit already, e.g., <code>oh-my-zsh</code>, which can be considered as a baseline for the further configuration.
</p>

<p>
Here is an example <code>~/.zshrc</code>.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Lines configured by zsh-newuser-install</span>
setopt notify
unsetopt beep
bindkey -e
<span style="color: #b22222;"># </span><span style="color: #b22222;">End of lines configured by zsh-newuser-install</span>

[[ $<span style="color: #a0522d;">TERM</span>==<span style="color: #8b2252;">"xterm"</span> ]] &amp;&amp; <span style="color: #483d8b;">export</span> <span style="color: #a0522d;">TERM</span>=xterm-256color

<span style="color: #b22222;"># </span><span style="color: #b22222;">If you come from bash you might have to change your $PATH.</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">export PATH=$HOME/bin:/usr/local/bin:$PATH</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Path to your oh-my-zsh installation.</span>
<span style="color: #483d8b;">export</span> <span style="color: #a0522d;">ZSH</span>=/usr/share/oh-my-zsh

<span style="color: #b22222;"># </span><span style="color: #b22222;">Set name of the theme to load. Optionally, if you set this to "random"</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">it'll load a random theme each time that oh-my-zsh is loaded.</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">See https://github.com/robbyrussell/oh-my-zsh/wiki/Themes</span>
<span style="color: #a0522d;">ZSH_THEME</span>=<span style="color: #8b2252;">"robbyrussell"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Uncomment the following line to use case-sensitive completion.</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">CASE_SENSITIVE="true"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Uncomment the following line to use hyphen-insensitive completion. Case</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">sensitive completion must be off. _ and - will be interchangeable.</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">HYPHEN_INSENSITIVE="true"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Uncomment the following line to disable bi-weekly auto-update checks.</span>
<span style="color: #a0522d;">DISABLE_AUTO_UPDATE</span>=<span style="color: #8b2252;">"true"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Uncomment the following line to change how often to auto-update (in days).</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">export UPDATE_ZSH_DAYS=13</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Uncomment the following line to disable colors in ls.</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">DISABLE_LS_COLORS="true"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Uncomment the following line to disable auto-setting terminal title.</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">DISABLE_AUTO_TITLE="true"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Uncomment the following line to enable command auto-correction.</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">ENABLE_CORRECTION="true"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Uncomment the following line to display red dots whilst waiting for completion.</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">COMPLETION_WAITING_DOTS="true"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Uncomment the following line if you want to disable marking untracked files</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">under VCS as dirty. This makes repository status check for large repositories</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">much, much faster.</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">DISABLE_UNTRACKED_FILES_DIRTY="true"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Uncomment the following line if you want to change the command execution time</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">stamp shown in the history command output.</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">The optional three formats: "mm/dd/yyyy"|"dd.mm.yyyy"|"yyyy-mm-dd"</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">HIST_STAMPS="mm/dd/yyyy"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Would you like to use another custom folder than $ZSH/custom?</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">ZSH_CUSTOM=/path/to/new-custom-folder</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Which plugins would you like to load? (plugins can be found in ~/.oh-my-zsh/plugins/*)</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Custom plugins may be added to ~/.oh-my-zsh/custom/plugins/</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Example format: plugins=(rails git textmate ruby lighthouse)</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Add wisely, as too many plugins slow down shell startup.</span>
<span style="color: #a0522d;">plugins</span>=(git)


<span style="color: #b22222;"># </span><span style="color: #b22222;">User configuration</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">export MANPATH="/usr/local/man:$MANPATH"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">You may need to manually set your language environment</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">export LANG=en_US.UTF-8</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Preferred editor for local and remote sessions</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">if [[ -n $SSH_CONNECTION ]]; then</span>
<span style="color: #b22222;">#   </span><span style="color: #b22222;">export EDITOR='vim'</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">else</span>
<span style="color: #b22222;">#   </span><span style="color: #b22222;">export EDITOR='mvim'</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">fi</span>
<span style="color: #483d8b;">export</span> <span style="color: #a0522d;">EDITOR</span>=<span style="color: #8b2252;">'emacs -nw'</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Compilation flags</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">export ARCHFLAGS="-arch x86_64"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">ssh</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">export SSH_KEY_PATH="~/.ssh/rsa_id"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Set personal aliases, overriding those provided by oh-my-zsh libs,</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">plugins, and themes. Aliases can be placed here, though oh-my-zsh</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">users are encouraged to define aliases within the ZSH_CUSTOM folder.</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">For a full list of active aliases, run `alias`.</span>
<span style="color: #b22222;">#</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Example aliases</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">alias zshconfig="mate ~/.zshrc"</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">alias ohmyzsh="mate ~/.oh-my-zsh"</span>
<span style="color: #483d8b;">alias</span> <span style="color: #a0522d;">ls</span>=<span style="color: #8b2252;">'ls --color=auto'</span>
<span style="color: #483d8b;">alias</span> <span style="color: #a0522d;">e</span>=<span style="color: #8b2252;">'/usr/bin/emacs -nw'</span>
<span style="color: #483d8b;">alias</span> <span style="color: #a0522d;">sudo</span>=<span style="color: #8b2252;">'sudo '</span>

<span style="color: #a0522d;">ZSH_CACHE_DIR</span>=$<span style="color: #a0522d;">HOME</span>/.oh-my-zsh-cache
<span style="color: #a020f0;">if</span> [[ ! -d $<span style="color: #a0522d;">ZSH_CACHE_DIR</span> ]]; <span style="color: #a020f0;">then</span>
    mkdir $<span style="color: #a0522d;">ZSH_CACHE_DIR</span>
<span style="color: #a020f0;">fi</span>

<span style="color: #483d8b;">source</span> $<span style="color: #a0522d;">ZSH</span>/oh-my-zsh.sh

</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
